Revit 2027 API
ReferenceIntersector(View3D) Constructor
 Constructs a ReferenceIntersector which is set to return intersections from all elements and representing all reference target types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ReferenceIntersector(
	View3D view3d
)
Public Sub New (
	view3d As View3D
)
public:
ReferenceIntersector(
	View3D^ view3d
)
new :
        view3d : View3D -> ReferenceIntersector
Parameters
view3d View3D
 The view in which to find references.
Exceptions
Exception | Condition
ArgumentException |  Returns true if the view is not a view template.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ReferenceIntersector Class
ReferenceIntersector Overload
Autodesk.Revit.DB Namespace